{"/en/about/":{"data":{"behavioral-skills-soft-skills#Behavioral Skills (Soft Skills)":" Clear and effective communication. Team collaboration ability. Analytical and problem-solving profile. Emotional intelligence (calm under pressure, support for colleagues). Active listening without interruptions. Continuous learning. ","courses-and-certifications#Courses and Certifications":" Typescript (B7Web, Jun/2025) Artificial Intelligence (Curso Em Vídeo, Mar/2025) Functions for Manipulating Data in PostgreSQL (DataCamp, Mar/2025) Object-Oriented Development Using the Python Language (Fundação Bradesco, Jul/2024) Introduction to Object-Oriented Programming (OOP) (Fundação Bradesco, Jul/2024) Data Analysis with Microsoft Power BI (Fundação Bradesco, Mar/2024) Data Manipulation in SQL (DataCamp, Jan/2024) JavaScript (B7Web, Mar/2023) Html5/Css3 (B7Web, Dec/2022) Programming Logic (TreinaWeb, Feb/2021) ","development-projects#Development Projects":"Content Management System - Blog (SPA \u0026 RESTful API) Links: github.com/minatti/portfolio-app | github.com/minatti/blog-api Description: Fullstack application developed to manage and display blog content, ideal for enriching portfolios and attracting clients. The Front-end was built with Vue.js (SPA), and the Backend as a RESTful API in Node.js, demonstrating skills in Front-end and Backend communication, data CRUD, and modern web application architecture. ","education#Education":"Bachelor’s Degree in Systems Analysis and Development (Uniasselvi - 6th Sem, prev 2025/26) Module 1 Professional Perspectives (pending) Society and Environment (completed) Information Technology Security (completed) Computer Architecture (completed) Software Engineering and Design (completed) Module 2 Scientific Methodology (completed) Fundamentals of Computer Networks (completed) Distributed Systems and Applications (completed) Database Principles (completed) Interdisciplinary Seminar: Introduction to Research (pending) Module 3 Information System (completed) Human-Computer Interaction (completed) Logic and Programming Techniques (completed) Software Process (completed) Interdisciplinary Seminar: Software Ergonomics (completed) Module 4 Advanced Database (completed) Introduction to Web Systems Development (completed) Programming Languages and Data Structures (completed) Object-Oriented Programming (completed) Interdisciplinary Seminar: Relational Database (pending) Module 5 Web Programming I (currently studying) Object-Oriented Analysis I (completed) Project Management (completed) Web Programming II (completed) Transversal Study I (completed) Interdisciplinary Seminar: Implementation of a WEB Application (completed) Module 6 Object-Oriented Analysis II (completed) Special Topics (currently studying) Knowledge Management (currently studying) Object-Oriented Project (currently studying) Transversal Study II (currently studying) Transversal Study III (currently studying) Interdisciplinary Seminar: Artificial Intelligence (completed) Technical Degree in Informatics (QI Faculdade e Escola Técnica, 2017) Object-Oriented Software Analysis and Design Office Automation Database I Database II Computer Graphics - Photoshop, Canvas Hardware Fundamentals Network and Connectivity Fundamentals Technical English Internet I - HTML5, CSS3 Internet II - Angularjs, Jquery Database Language – Mysql Mobile Programming Language – Javascript Visual Programming Language – Java Web Programming Language – Php Programming Logic – Java Applied Mathematics to Informatics Human Relations in Organizations Servers - Windows Server Operating System - Linux ","luan-carminatti#Luan Carminatti":"Luan CarminattiFullstack Developer (JS/Java) | Data, Systems Analyst\nCanoas, RS | luancarminatt@gmail.com | LinkedIn | GitHub","professional-experience#Professional Experience":"Grupo Redebrasil, Canoas – RS BI Analyst / Dec/2022 – Apr/2025 (2 years and 5 months)\nResponsible with the team for the implementation and migration of processes and reports to PowerBI, resulting in greater efficiency and data integrity. Acted in the creation of automation solutions to optimize time and eliminate manual processes. Data manipulation and modeling (ETL/ELT) from various sources (SQL Server, PostgreSQL, files, web scraping). Development and optimization of SQL queries, tables, and views for high performance and data integrity. Application of agile methodologies (Kanban) in project and activity management. Savarauto, Canoas – RS IT Analyst/Developer / Jun/2021 – Aug/2021 (3 months)\nWeb Development: Creation of a satisfaction survey page with Bootstrap, PHP, and JavaScript, integrated with an Oracle database. Automation: Development of a PHP functionality for generating personalized LGPD documents in PDF, and a Python script for automating session termination on a server. Interactive Development: Participation in the creation of an interactive course module in JavaScript, including new logic and automatic certificate issuance. Technical support and direct contact with third-party development companies for bug fixes and system improvements. ","summary#Summary":"Technology professional with a solid background in Systems Analysis and Development and practical experience in building web applications and automation. My foundation includes Front-end development (HTML5, CSS3, JavaScript, Bootstrap), Backend (PHP, Python), and a Fullstack project in the JavaScript ecosystem (Vue.js, Node.js), in addition to strong database proficiency (SQL). I am now strategically transitioning to consolidate myself as a Fullstack Developer, focusing on Java Web for Backend (including knowledge acquired in a specific discipline and deepening in modern frameworks like Quarkus). I seek a challenging position that allows me to continuously evolve, applying my analytical profile and problem-solving ability.","technical-skills#Technical Skills":" Programming Languages: PHP, Python, JavaScript (ES6+, TypeScript), studying Java. Frontend: Vue.js, Html5, Css3, Bootstrap, Figma. (Future: Angular) Backend: Node.js, RESTful API, OOP (Object-Oriented Programming). (Future: Java with Quarkus framework) Databases: SQL (SQL Server, PostgreSQL), Data Modeling (Star Schema, Snowflake Schema), ETL/ELT. Automation: Creation of scripts for process optimization. Tools and Methodologies: Git, GitHub, Trello, Kanban. Insomnia. "},"title":"About"},"/en/blog/first-post/":{"data":{"":"Hello world!"},"title":"First Post"},"/en/books/":{"data":{"":"","recommended-reading#Recommended Reading.":"*(https://www.amazon.com.br/Homem-Mais-Rico-Babil%C3%B4nia/dp/8595081530/ref=sr_1_2?crid=2Q5IDTZ2TOKSY\u0026keywords=o+homem+mais+rico+da+babilonia\u0026qid=1696806427\u0026sprefix=o+homem+mais%2Caps%2C261\u0026sr=8-2) *(https://www.amazon.com.br/poder-do-h%C3%A1bito-Charles-Duhigg/dp/8539004119/ref=sr_1_1_sspa?crid=3JCOPGEO8B5SB\u0026keywords=o+poder+do+habito\u0026qid=1696806063\u0026sprefix=o+poder+%2Caps%2C224\u0026sr=8-1-spons\u0026sp_csd=d2lkZ2V0TmFtZT1zcF9hdGY\u0026psc=1)\nPassive Income *(https://www.amazon.com.br/Os-h%C3%A1bitos-memoriza%C3%A7%C3%A3o-Renato-Alves/dp/8573127619/ref=sr_1_1?crid=24N1CGW762VGZ\u0026keywords=os+10+habitos+da+memoriza%C3%A7%C3%A3o\u0026qid=1696805960\u0026sprefix=os+10+ha%2Caps%2C218\u0026sr=8-1) *(https://www.amazon.com.br/Fa%C3%A7a-c%C3%A9rebro-trabalhar-para-voc%C3%AA/dp/8573128216/ref=sr_1_1?crid=ACPCIU5RMLLH\u0026keywords=fa%C3%A7a+seu+cerebro+trabalhar+por+voce\u0026qid=1696805942\u0026sprefix=Fa%C3%A7a+seu+ce%2Caps%2C208\u0026sr=8-1) *(https://www.amazon.com.br/arte-procrastina%C3%A7%C3%A3o-John-Perry/dp/8565530671/ref=sr_1_1?__mk_pt_BR=%C3%85M%C3%85%C5%BD%C3%95%C3%91\u0026crid=3LEP7SQZQHCEJ\u0026keywords=arte+da+procrastina%C3%A7%C3%A3o\u0026qid=1696805895\u0026sprefix=arte+da+procastina%C3%A7%C3%A3%2Caps%2C241\u0026sr=8-1) *(https://www.amazon.com.br/Pai-rico-pai-pobre-anos/dp/8550801488/ref=sr_1_1?crid=3UD5N6QMF4C5B\u0026dib=eyJ2IjoiMSJ9.WD8YpvYMo_P4mBicXrLGFxzIHk37BZreQ9kxwhivKSfyKa1EpuH9VbO-1ohNeNDhO-8MC4-aYg3_B31sddH8luY-pmKQp2MGzCws2utYR6jQ8ub_bz0sPNGN4DjlGBCJPnheX8EkOOMhF6DT7IQ7vknlyWHV-_91lQCoxS4NgnSp4XrrHmDTQebEX9xbgR7IEyMerPzhjxIqQ2j0-r4zyemL_qYoh63KK_t04RpBtYv-NdfVl7F18qSp7_NjfqCl8_v_DKlFO15VuXkZe96UK48aCABtCNOIuu89kFLABU8.PBofYznXbb8wG74U6obVM5DUBOj2EjWBFfSCy2ebEY\u0026dib_tag=se\u0026keywords=pai+rico+pai+pobre\u0026qid=1753904311\u0026sprefix=pai+ri%2Caps%2C214\u0026sr=8-1) "},"title":"Books"}}